---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.BadReferenceToSecondary
source: html/5eaf6961-070d-59b6-d563-f99b3edfd126.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.BadReferenceToSecondary Property

No element in a secondary Option can be referenced by an element outside that Option.

## Syntax (C#)
```csharp
public static FailureDefinitionId BadReferenceToSecondary { get; }
```